# Типы данных в питоне 

# 1. NoneType - ничего, пустота -> None 
# 2. Boolean - истина или ложь -> True/False
# 3. string - строки - str -> "Hello world", 'Hello world'
#"My name John Snow!"
# "I'm North King"
# 'I\'m North North' # "\ просто кавычки для текста"
# 4. Числовые типы данных
   #   a) integer - целое число int -> -1, 2, 555
   #   b) float - число с плавающей точкой -> 1.5, 15.25
   #   c) complex - 0j: 1, 5 - 9j
# 5. Списковые типы данных (коллекция) 
    #  a) list(массив/список) -> [5, 2, 4, True, 'hello']
    # b) tuple(кортеж) -> (1, 2, 3, None)
    # c) range(последовательность) -> range(1, 10)
# 6. set() - множество -> {1,2,3,4,5,6,7,8}
# 7. dict(словари) -> содержат данные в себе в виде ключа и значение {1: 'one', 2: 'two'} 
#-------------------------------
# Mutabel(измениня типо данных)
# 1. list
# 2. set
# 3. dict 

# Immutable(неизменяемые типы данных)
# 1.None 
# 2. bool
# 3. int, float, copmlex
# 4. str
# 5. tuple
# 6. frozenset
# --------------------------------

# Переменная - проименованая область в памяти, предназначеная для хранение данных. С ее помощью мы можем проводить различные операции с данными

# num = 5 
# str1 = "Hello world!"
# '''
# Стандартные вывод данных
# '''
# #   В питоне для вывода дынных в терминал используется встроеная функция ptint() 
# stroka = "Hello world my name is John Snow!"
# print(stroka)
# print(27 + 5)

'''
Стандартный ввод данных через терминал испльзуется функций input()
'''

# a = input("Введите число: ") 
# num = int(a)
# # print(num)
# # print(type(num))
# # print ("Данные в переменных:", a, num)
# print("В переменной а храниться:", a, "ее тип данных", type (a))
# print("В переменной num хранится", num, "ее тип данных", type(num))







