# GIT - распределеная система котроля версий 
# это система для отслеживания и введение истории изменение файлов, в вашем проекте при помощи распределенности git еще и организовывается командная разработка.

# Репозиториий - это хранилище вашего кода и истории его изменений

# GitHub - веб сайт для размещение git-репозиторий в совместной разработке проектов


# команды Git:

# 1. git init - она создает новый локальный репозиторий(репо), 
# в той деректории в которой была прописана команда. (Команда вводится один раз в начале)

# 2. git add - команда для допалнение изменение в системе отслеживание гита 

# 3. git commit -m "<comment>" - команда для сохранение всех изменений в локальном репозитории с комментарием к ним

# 4. git remote add <origin> <url> - это команда для того чтобы связять ваш локальный репо с удаленным репо в гитхабе

# 5. git push <origin> <main> - комнда отправки всех ваших изменений на удаленный репо  









